import 'package:imsakia/models/azkar.dart';

final List<Azkar> clothesAzkarList = [
  Azkar(
    id: 'clothes_1',
    category: 'clothes',
    header: 'ما يقال عند لبس الثوب',
    text: '''عن معاذ بن أنس أن رسول الله قال :
  ومَنْ لَبِسَ ثوباً فقال : 
  (الحمدُ لله الذي كَساني هذا الثـوب ورَزَقنيه مِنْ غيِر حـولٍ منِّي ولا قُوّةٍ، غُفـِرَ له مـا تقـدَّم مـِنْ ذنْبِه)''',
    target: 1,
  ),
  Azkar(
    id: 'clothes_2',
    category: 'clothes',
    header: 'ما يقول إذا وضع ثوبه',
    text: '''عن أنس قال:
قال رسول الله:
سترُ ما بينَ أعْيُنِ الجنِّ وعوْراتِ بني آدمَ إذا وضعَ أحدهـم ثوبهُ أنْ يقولَ:
بسمِ الله''',
    target: 1,
  ),
  Azkar(
    id: 'clothes_3',
    category: 'clothes',
    header: 'الدعاء إذا لبس ثوباً جديداً',
    text: '''عن أبي سعيد الخدري قال :
كان رسول الله إذا استجَدَّ ثوباً سماهُ بِاسمهِ، إما قميصاً، أو عمامةً، ثم يقولُ :
(اللَّهمَّ لكَ الحمدُ، أنتَ كَسَوتنِيهِ أسألُكَ مِنْ خيرهِ، وخيرِ ما صُنِعَ لهُ، وأعوذُ بكَ من شرِّهِ، وشرِّ ما صُنِعَ لهُ)''',
    target: 1,
  ),
  Azkar(
    id: 'clothes_4',
    category: 'clothes',
    header: 'الدعاء لمن لبس الجديد',
    text: '''عن ابن عمر قال رأى النبي على عمر ثوباً أبيض فقال:
(أجديدٌ هذا أم غسيل؟)
فقال:
غسيل.(وفي رواية جديداً)
فقال:
(الْبَسْ جَديداً، وعِشْ حَميداً، ومُتْ شهيداً، ويرزقُكَ اللهُ قرَّةَ عينٍ في الدُّنيا والآخِرةِ)''',
    target: 1,
  ),
  Azkar(
    id: 'clothes_5',
    category: 'clothes',
    header: 'الدعاء لمن لبس الجديد',
    text:
        '''قال أبو نضرَةَ كانَ أصحَابُ النبيِّ إذا لـَبِسَ أحَدُهُـمْ ثَوبـاً جَدِيداً قِيلَ لهُ:
تُبْلِي ويُخْلِفُ اللهُ تَعَالَى.''',
    target: 1,
  ),
];
