import 'package:imsakia/models/azkar.dart';

final List<Azkar> foodAzkarList = [
  Azkar(
    id: 'food_1',
    category: 'food',
    header: 'الذكر عند الطعام والشراب',
    text: '''بِسْمِ اللهِ.
فإنْ نسي في أَوَّلِهِ، فَليَقُلْ:
بِسْمِ اللهِ أَوَّلَهُ وَآخِرَهُ.''',
    target: 1,
  ),
  Azkar(
    id: 'food_2',
    category: 'food',
    header: 'الذكر عند شرب اللبن',
    text: 'اَللَّهُمَّ بَارِكْ لَنَا فِيهِ, وَزِدْنَا مِنْهُ.',
    target: 1,
  ),
  Azkar(
    id: 'food_3',
    category: 'food',
    header: 'الذكر عند الفراغ من الطعام والشراب',
    text:
        '''الْحَمْدُ للهِ الَّذِي أَطْعَمَنِي هَذَا, وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِّنِّي وَلاَ قُوَّةٍ.
  الْحَمْدُ لِلَّهِ كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ غَيْرَ مَكْفِيٍّ وَلَا مُوَدَّعٍ وَلَا مُسْتَغْنًى عَنْهُ رَبَّنَا.''',
    comment: 'غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ.',
    target: 1,
  ),

  Azkar(
    id: 'food_4',
    category: 'food',
    header: 'أذكار الضيف',
    text:
        'أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ ، وَأَكَلَ طَعَامَكُمُ الأَبْرَارُ ، وَصَلَّتْ عَلَيْكُمُ الْمَلائِكَةُ.',

    target: 1,
  ),
  Azkar(
    id: 'food_5',
    category: 'food',
    header: 'هدى النبى فى الشرب',
    text:
        'كَانَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَشْرَبُ فِي ثَلاَثَةِ أَنْفَاسٍ، إِذَا أَدْنَى الإِنَاءَ إِلَى فَمِهِ سَمَّى اللهَ تَعَالَى, وَإِذَا أَخَّرَهُ حَمِدَ اللهَ تَعَالَى، يَفْعَلُ ذَلِكَ ثَلاَثَ مَرَّاتٍ. ',

    target: 1,
  ),
];
